balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F6722.PIC
      <edc:DCRDef edc:access="-n------" edc:cname="CONFIG7H" edc:default="0x40" edc:desc="" edc:impl="0x40" edc:name="CONFIG7H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x40">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="EBTRB" edc:desc="Boot Block Table Read Protection bit" edc:mask="0x1" edc:name="EBTRB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-007FFF, 000FFF or 001FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-007FFF, 000FFF or 001FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:DeviceIDSector edc:beginaddr="0x3ffffe" edc:endaddr="0x400000" edc:mask="0xffe0" edc:regionid="devid" edc:value="0x1400"/>
    <edc:EEDataSector edc:beginaddr="0xf00000" edc:endaddr="0xf00400" edc:regionid="eedata"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x200028" edc:endaddr="0x200038" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x60" edc:endaddr="0x100" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0x1" edc:beginaddr="0x100" edc:endaddr="0x200" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="0x2" edc:beginaddr="0x200" edc:endaddr="0x300" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="0x3" edc:beginaddr="0x300" edc:endaddr="0x400" edc:regionid="gpr3"/>
      <edc:GPRDataSector edc:bank="0x4" edc:beginaddr="0x400" edc:endaddr="0x500" edc:regionid="gpr4"/>
      <edc:GPRDataSector edc:bank="0x5" edc:beginaddr="0x500" edc:endaddr="0x600" edc:regionid="gpr5"/>
      <edc:GPRDataSector edc:bank="0x6" edc:beginaddr="0x600" edc:endaddr="0x700" edc:regionid="gpr6"/>
      <edc:GPRDataSector edc:bank="0x7" edc:beginaddr="0x700" edc:endaddr="0x800" edc:regionid="gpr7"/>
      <edc:GPRDataSector edc:bank="0x8" edc:beginaddr="0x800" edc:endaddr="0x900" edc:regionid="gpr8"/>
      <edc:GPRDataSector edc:bank="0x9" edc:beginaddr="0x900" edc:endaddr="0xa00" edc:regionid="gpr9"/>
      <edc:GPRDataSector edc:bank="0xa" edc:beginaddr="0xa00" edc:endaddr="0xb00" edc:regionid="gpr10"/>
      <edc:GPRDataSector edc:bank="0xb" edc:beginaddr="0xb00" edc:endaddr="0xc00" edc:regionid="gpr11"/>
      <edc:GPRDataSector edc:bank="0xc" edc:beginaddr="0xc00" edc:endaddr="0xd00" edc:regionid="gpr12"/>
      <edc:GPRDataSector edc:bank="0xd" edc:beginaddr="0xd00" edc:endaddr="0xe00" edc:regionid="gpr13"/>
      <edc:GPRDataSector edc:bank="0xe" edc:beginaddr="0xe00" edc:endaddr="0xf00" edc:regionid="gpr14"/>
      <edc:GPRDataSector edc:bank="0xf" edc:beginaddr="0xf00" edc:endaddr="0xf60" edc:regionid="gpr15"/>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2CON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2CON2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEN2" edc:desc="" edc:mask="0x1" edc:name="SEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEN2" edc:desc="" edc:mask="0x1" edc:name="RSEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PEN2" edc:desc="" edc:mask="0x1" edc:name="PEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCEN2" edc:desc="" edc:mask="0x1" edc:name="RCEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKEN2" edc:desc="" edc:mask="0x1" edc:name="ACKEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKDT2" edc:desc="" edc:mask="0x1" edc:name="ACKDT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT2" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCEN2" edc:desc="" edc:mask="0x1" edc:name="GCEN2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2CON1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPM" edc:desc="" edc:mask="0xf" edc:name="SSPM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPEN" edc:desc="" edc:mask="0x1" edc:name="SSPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPOV" edc:desc="" edc:mask="0x1" edc:name="SSPOV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="" edc:mask="0x1" edc:name="WCOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPM0" edc:desc="" edc:mask="0x1" edc:name="SSPM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPM1" edc:desc="" edc:mask="0x1" edc:name="SSPM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPM2" edc:desc="" edc:mask="0x1" edc:name="SSPM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPM3" edc:desc="" edc:mask="0x1" edc:name="SSPM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSPM02" edc:desc="" edc:mask="0x1" edc:name="SSPM02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM12" edc:desc="" edc:mask="0x1" edc:name="SSPM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM22" edc:desc="" edc:mask="0x1" edc:name="SSPM22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM32" edc:desc="" edc:mask="0x1" edc:name="SSPM32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKP2" edc:desc="" edc:mask="0x1" edc:name="CKP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPEN2" edc:desc="" edc:mask="0x1" edc:name="SSPEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPOV2" edc:desc="" edc:mask="0x1" edc:name="SSPOV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WCOL2" edc:desc="" edc:mask="0x1" edc:name="WCOL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2STAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2STAT" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R/nW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D/nA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R_nW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D_nA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ" edc:desc="" edc:mask="0x1" edc:name="I2C_READ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C_START" edc:desc="" edc:mask="0x1" edc:name="I2C_START" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nW" edc:desc="" edc:mask="0x1" edc:name="nW" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nA" edc:desc="" edc:mask="0x1" edc:name="nA" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nWRITE" edc:desc="" edc:mask="0x1" edc:name="nWRITE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS" edc:desc="" edc:mask="0x1" edc:name="nADDRESS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="D" edc:desc="" edc:mask="0x1" edc:name="D" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:SFRFieldDef edc:cname="BF2" edc:desc="" edc:mask="0x1" edc:name="BF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA2" edc:desc="" edc:mask="0x1" edc:name="UA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RW2" edc:desc="" edc:mask="0x1" edc:name="RW2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="START2" edc:desc="" edc:mask="0x1" edc:name="START2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STOP2" edc:desc="" edc:mask="0x1" edc:name="STOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DA2" edc:desc="" edc:mask="0x1" edc:name="DA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE2" edc:desc="" edc:mask="0x1" edc:name="CKE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP2" edc:desc="" edc:mask="0x1" edc:name="SMP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
